export const sticky = {
  task: {
    add: 'Создать задачу',
    edit: 'Редактировать задачу',
    delete: 'Удалить задачу',
    hint: 'Показать подсказку',
    tests: 'Показать тесты',
  },
  assignment: {
    add: 'Создать урок',
    edit: 'Редактировать урок',
    delete: 'Удалить урок',
    dashboard: 'Панель управления уроком',
  },
  assignmentSchema: {
    add: 'Создать схему урока',
    edit: 'Редактировать схему урока',
    delete: 'Удалить схему урока',
  },
  group: {
    add: 'Создать группу',
    edit: 'Редактировать группу',
    delete: 'Удалить группу',
  },
  tournament: {
    add: 'Создать турнир',
    edit: 'Редактировать турнир',
    delete: 'Удалить турнир',
    myTeam: 'Моя команда',
    pin: 'Пин-код',
    dashboard: 'Панель управления турниром',
    results: 'Таблица результатов',
  },
  tests: {
    download: 'Скачать тесты',
  },
  attempt: {
    ban: 'Забанить попытку',
    unban: 'Разбанить попытку',
  },
  user: {
    edit: 'Редактировать пользователя',
    delete: 'Удалить пользователя',
  },
  team: {
    delete: 'Удалить команду',
  },
};
