export const courseTree = {
  title: 'Название курса',
  description: 'Описание курса',
  unit: 'Модуль',
  lesson: 'Урок',
  newUnit: 'Новый модуль',
  newLesson: 'Новый урок',
  addUnit: 'Добавить модуль в качестве дочернего элемента',
  addLesson: 'Добавить урок в качестве дочернего элемента',
  moveElement: 'Переместить выбранный элемент и его дочерние элементы',
  deleteElement: 'Удалить выбранный элемент и его дочерние элементы',
  showChildren: 'Показать дочерние элементы',
  hideChildren: 'Скрыть дочерние элементы',
};
