export const lesson = {
  form: {
    title: "Название",
    description: "Описание",
    labels: ["Шаг первый", "Шаг второй"],
    descriptions: ["Основная информация", "Дополнительная информация"],
    assessmentType: {
      title: "Тип оценивания",
      variants: ["Потестовая оценка", "Оценка по полностью сданной задаче"],
    },
    validation: {
      title: "Название не должно быть короче 5 символов",
      description: "Описание должно быть не короче 20 символов",
      assessmentType: "Выберите тип оценивания",
    },
  },
};
