export const tournament = {
  registration: [
    'Вам необходимо зарегистрироваться для участия в турнире',
  ],
  registrationWarning: [
    'После начала турнира регистрация будет запрещена',
  ],

  refusal: ['Отмените регистрацию для прекращения участия в турнире'],
  refusalWarning: [
    'Регистрация после начала турнира запрещена',
    'Если вы отмените регистрация сейчас, вы больше не сможете зарегистрироваться',
  ],
  security: [
    'При открытой регистрации для участия в турнире пользователю нужно просто нажать кнопку "Зарегистрироваться"',
    'При регистрации по пин-коду, пользователю, чтобы подтвердить участие, нужно будет ввести специальный код',
    'Пин-код доступен создателю и модераторам в специальной форме на странице турнире (рядом с кнопками редактирования и удаления)',
  ],
  maxTeamSize: 'Установите значение 1 если турнир личный',
};
