export const task_test = {
  delete: {
    loading: 'Удаляем тест',
    success: 'Тест успешно удалён',
    error: 'Ошибка при удалении теста',
  },
  post: {
    loading: 'Добавляем тесты',
    success: 'Тесты успешно добавлены',
    error: 'Ошибка при добавлении тестов',
  },

  put: {
    loading: 'Обновляем тест',
    success: 'Тест успешно обновлён',
    error: 'Ошибка при обновлении теста',
  },
  reorder: {
    loading: 'Изменяем порядок тестов',
    success: 'Порядок тестов успешно изменен',
    error: 'Ошибка при изменении порядка тестов',
  },
};
