export const task = {
  attempts: {
    list: {
      loading: '',
      success: '',
      error: 'Ошибка при получении попыток',
    },
  },
  create: {
    loading: 'Создаём задачу',
    success: 'Задача успешно создана',
    error: 'Ошибка при создании задачи',
  },
  edit: {
    loading: 'Обновляем задачу',
    success: 'Задача успешно обновлена',
    error: 'Ошибка при обновлении задачи',
  },
  delete: {
    loading: 'Удаляем задачу',
    success: 'Задача успешно удалена',
    error: 'Ошибка при удалении задачи',
  },
  send: {
    loading: 'Отправляем задачу',
    success: 'Задача успешно отправлена',
    error: 'Ошибка при отправке задачи',
  },
  validation: {
    error: 'Ошибка валидации',
  },
  tests: {
    error: 'Ошибка при получении тестов',
    loading: 'Загрузка тестов',
  },
};
