export const team = {
  edit: {
    loading: 'Обновляем команду',
    success: 'Команда успешно обновлена',
    error: 'Ошибка при обновлении команды',
  },
  delete: {
    loading: 'Удаляем команду',
    success: 'Команда успешно удалена',
    error: 'Ошибка при удалении команды',
  },
  kickParticipant: {
    loading: 'Исключаем участника',
    success: 'Участник успешно исключен',
    error: 'Ошибка при исключении участника',
  },
  ban: {
    loading: 'Баним команду',
    success: 'Команда успешно забанена',
    error: 'Ошибка при бане команды',
  },
  unban: {
    loading: 'Разбаниваем команду',
    success: 'Команда успешно разбанена',
    error: 'Ошибка при разбане команды',
  },
};
