export const tournament = {
  create: {
    loading: 'Создаём турнир',
    success: 'Турнир успешно создан',
    error: 'Ошибка при создании турнира',
  },
  edit: {
    loading: 'Обновляем турнир',
    success: 'Турнир успешно обновлён',
    error: 'Ошибка при обновлении турнира',
  },
  delete: {
    loading: 'Удаляем турнир',
    success: 'Турнир успешно удалён',
    error: 'Ошибка при удалении турнира',
  },
  registration: {
    loading: 'Регистрируем',
    success: 'Вы успешно зарегистрированы',
    error: 'Ошибка при регистрации',
  },
  refusal: {
    loading: 'Отменяем регистрацию',
    success: 'Вы успешно отменили регистрацию',
    error: 'Ошибка при отмене регистрации',
  },
  banUser: {
    loading: 'Баним пользователя',
    success: 'Пользователь успешно забанен',
    error: 'Ошибка при бане пользователя',
  },
  unbanUser: {
    loading: 'Отменяем бан пользователя',
    success: 'Пользователь успешно разбанен',
    error: 'Ошибка при разбане пользователя',
  },
  timer: {
    started: 'Турнир начался!',
    finished: 'Турнир закончился!',
  },
  settings: {
    changePublic: {
      loading: 'Изменяем публичность задач',
      success: 'Публичность задач успешно изменена',
      error: 'Ошибка при изменении публичности задач',
    },
    allowRegistrationAfterStart: {
      loading: 'Изменяем возможность регистрации после начала',
      success:
        'Возможность регистрации после начала успешно изменена',
      error: 'Ошибка при изменении возможности регистрации',
    },
  },
};
